Дошкольное_учреждение83/src/Documents/удуДоговорОЗачисленииРебенка/удуДоговорОЗачисленииРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуДоговорОЗачисленииРебенка</name>
  <basedOn>Document.удуЗаявкаНаЗачислениеРебенкаВДОУ</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоЗачисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоОтчисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакФормированияБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОснование</name>
    <type>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиОплаты</name>
    <type>
      <types>EnumRef.удуВидыСтавокРодительскойПлаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/CommonForms/удуФормаВыбораДоговора/Module.bsl
&НаСервере
Процедура СформироватьСписокДоговоровНаСервере()
	ТекстЗапроса = "ВЫБРАТЬ
			|	удуДоговорОЗачисленииРебенка.Ссылка
			|ИЗ
			|	Документ.удуДоговорОЗачисленииРебенка КАК удуДоговорОЗачисленииРебенка
			|ГДЕ
			|	(НЕ удуДоговорОЗачисленииРебенка.ПометкаУдаления)				   
			|	И (НЕ удуДоговорОЗачисленииРебенка.ПроизошлоЗачисление)";
	
	Если ЗначениеЗаполнено(ПараметрГруппа) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
			|	И удуДоговорОЗачисленииРебенка.Группа = &Группа";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрРебенок) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
			|	И 	удуДоговорОЗачисленииРебенка.Ребенок = &Ребенок";
	КонецЕсли;
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ребенок", ПараметрРебенок);
	Запрос.УстановитьПараметр("Группа", ПараметрГруппа);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СписокСсылокДляОтбора = Новый СписокЗначений;
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		СписокСсылокДляОтбора.Добавить(СтрокаРезультат.Ссылка);		
	КонецЦикла;
	
	ЭлементОтбораНайден = Ложь;
	
	Для Каждого СтрокаЭлемент Из СписокДоговоровКЗачислению.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Ссылка" Тогда
			ЭлементОтбораНайден = Истина;
			СтрокаЭлемент.ПравоеЗначение = СписокСсылокДляОтбора;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЭлементОтбораНайден Тогда
		ЭлементОтбораРодителя = СписокДоговоровКЗачислению.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораРодителя.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбораРодителя.Использование = Истина;
		ЭлементОтбораРодителя.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбораРодителя.ПравоеЗначение = СписокСсылокДляОтбора;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСписокДоговоровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровКЗачислениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовыйДоговор(Команда)
	// Вставить содержимое обработчика.
	ФормаВводаДоговора = ПолучитьФорму("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента");
	ФормаВводаДоговора.ОткрытьМодально();
	СформироватьСписокДоговоровНаСервере();
КонецПроцедуры
